MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS169/mcu.h
extern volatile __GLCDCLUT181bits_t GLCDCLUT181bits __asm__ ("GLCDCLUT181") __attribute__((section("sfrs"), address(0xBF8EA6D4)));
#define GLCDCLUT182 GLCDCLUT182
extern volatile uint32_t   GLCDCLUT182 __attribute__((section("sfrs"), address(0xBF8EA6D8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT182bits_t;
extern volatile __GLCDCLUT182bits_t GLCDCLUT182bits __asm__ ("GLCDCLUT182") __attribute__((section("sfrs"), address(0xBF8EA6D8)));
#define GLCDCLUT183 GLCDCLUT183
extern volatile uint32_t   GLCDCLUT183 __attribute__((section("sfrs"), address(0xBF8EA6DC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT183bits_t;
extern volatile __GLCDCLUT183bits_t GLCDCLUT183bits __asm__ ("GLCDCLUT183") __attribute__((section("sfrs"), address(0xBF8EA6DC)));
#define GLCDCLUT184 GLCDCLUT184
extern volatile uint32_t   GLCDCLUT184 __attribute__((section("sfrs"), address(0xBF8EA6E0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT184bits_t;
extern volatile __GLCDCLUT184bits_t GLCDCLUT184bits __asm__ ("GLCDCLUT184") __attribute__((section("sfrs"), address(0xBF8EA6E0)));
#define GLCDCLUT185 GLCDCLUT185
extern volatile uint32_t   GLCDCLUT185 __attribute__((section("sfrs"), address(0xBF8EA6E4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT185bits_t;
extern volatile __GLCDCLUT185bits_t GLCDCLUT185bits __asm__ ("GLCDCLUT185") __attribute__((section("sfrs"), address(0xBF8EA6E4)));
#define GLCDCLUT186 GLCDCLUT186
extern volatile uint32_t   GLCDCLUT186 __attribute__((section("sfrs"), address(0xBF8EA6E8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT186bits_t;
extern volatile __GLCDCLUT186bits_t GLCDCLUT186bits __asm__ ("GLCDCLUT186") __attribute__((section("sfrs"), address(0xBF8EA6E8)));
#define GLCDCLUT187 GLCDCLUT187
extern volatile uint32_t   GLCDCLUT187 __attribute__((section("sfrs"), address(0xBF8EA6EC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT187bits_t;
extern volatile __GLCDCLUT187bits_t GLCDCLUT187bits __asm__ ("GLCDCLUT187") __attribute__((section("sfrs"), address(0xBF8EA6EC)));
#define GLCDCLUT188 GLCDCLUT188
extern volatile uint32_t   GLCDCLUT188 __attribute__((section("sfrs"), address(0xBF8EA6F0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT188bits_t;
extern volatile __GLCDCLUT188bits_t GLCDCLUT188bits __asm__ ("GLCDCLUT188") __attribute__((section("sfrs"), address(0xBF8EA6F0)));
#define GLCDCLUT189 GLCDCLUT189
extern volatile uint32_t   GLCDCLUT189 __attribute__((section("sfrs"), address(0xBF8EA6F4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT189bits_t;
extern volatile __GLCDCLUT189bits_t GLCDCLUT189bits __asm__ ("GLCDCLUT189") __attribute__((section("sfrs"), address(0xBF8EA6F4)));
#define GLCDCLUT190 GLCDCLUT190
extern volatile uint32_t   GLCDCLUT190 __attribute__((section("sfrs"), address(0xBF8EA6F8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT190bits_t;
extern volatile __GLCDCLUT190bits_t GLCDCLUT190bits __asm__ ("GLCDCLUT190") __attribute__((section("sfrs"), address(0xBF8EA6F8)));
#define GLCDCLUT191 GLCDCLUT191
extern volatile uint32_t   GLCDCLUT191 __attribute__((section("sfrs"), address(0xBF8EA6FC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT191bits_t;
extern volatile __GLCDCLUT191bits_t GLCDCLUT191bits __asm__ ("GLCDCLUT191") __attribute__((section("sfrs"), address(0xBF8EA6FC)));
#define GLCDCLUT192 GLCDCLUT192
extern volatile uint32_t   GLCDCLUT192 __attribute__((section("sfrs"), address(0xBF8EA700)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT192bits_t;
extern volatile __GLCDCLUT192bits_t GLCDCLUT192bits __asm__ ("GLCDCLUT192") __attribute__((section("sfrs"), address(0xBF8EA700)));
#define GLCDCLUT193 GLCDCLUT193
extern volatile uint32_t   GLCDCLUT193 __attribute__((section("sfrs"), address(0xBF8EA704)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT193bits_t;
extern volatile __GLCDCLUT193bits_t GLCDCLUT193bits __asm__ ("GLCDCLUT193") __attribute__((section("sfrs"), address(0xBF8EA704)));
#define GLCDCLUT194 GLCDCLUT194
extern volatile uint32_t   GLCDCLUT194 __attribute__((section("sfrs"), address(0xBF8EA708)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT194bits_t;
extern volatile __GLCDCLUT194bits_t GLCDCLUT194bits __asm__ ("GLCDCLUT194") __attribute__((section("sfrs"), address(0xBF8EA708)));
#define GLCDCLUT195 GLCDCLUT195
extern volatile uint32_t   GLCDCLUT195 __attribute__((section("sfrs"), address(0xBF8EA70C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT195bits_t;
extern volatile __GLCDCLUT195bits_t GLCDCLUT195bits __asm__ ("GLCDCLUT195") __attribute__((section("sfrs"), address(0xBF8EA70C)));
#define GLCDCLUT196 GLCDCLUT196
extern volatile uint32_t   GLCDCLUT196 __attribute__((section("sfrs"), address(0xBF8EA710)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT196bits_t;
extern volatile __GLCDCLUT196bits_t GLCDCLUT196bits __asm__ ("GLCDCLUT196") __attribute__((section("sfrs"), address(0xBF8EA710)));
#define GLCDCLUT197 GLCDCLUT197
extern volatile uint32_t   GLCDCLUT197 __attribute__((section("sfrs"), address(0xBF8EA714)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT197bits_t;
extern volatile __GLCDCLUT197bits_t GLCDCLUT197bits __asm__ ("GLCDCLUT197") __attribute__((section("sfrs"), address(0xBF8EA714)));
#define GLCDCLUT198 GLCDCLUT198
extern volatile uint32_t   GLCDCLUT198 __attribute__((section("sfrs"), address(0xBF8EA718)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT198bits_t;
extern volatile __GLCDCLUT198bits_t GLCDCLUT198bits __asm__ ("GLCDCLUT198") __attribute__((section("sfrs"), address(0xBF8EA718)));
#define GLCDCLUT199 GLCDCLUT199
extern volatile uint32_t   GLCDCLUT199 __attribute__((section("sfrs"), address(0xBF8EA71C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT199bits_t;
extern volatile __GLCDCLUT199bits_t GLCDCLUT199bits __asm__ ("GLCDCLUT199") __attribute__((section("sfrs"), address(0xBF8EA71C)));
#define GLCDCLUT200 GLCDCLUT200
extern volatile uint32_t   GLCDCLUT200 __attribute__((section("sfrs"), address(0xBF8EA720)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT200bits_t;
extern volatile __GLCDCLUT200bits_t GLCDCLUT200bits __asm__ ("GLCDCLUT200") __attribute__((section("sfrs"), address(0xBF8EA720)));
#define GLCDCLUT201 GLCDCLUT201
extern volatile uint32_t   GLCDCLUT201 __attribute__((section("sfrs"), address(0xBF8EA724)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT201bits_t;
extern volatile __GLCDCLUT201bits_t GLCDCLUT201bits __asm__ ("GLCDCLUT201") __attribute__((section("sfrs"), address(0xBF8EA724)));
#define GLCDCLUT202 GLCDCLUT202
extern volatile uint32_t   GLCDCLUT202 __attribute__((section("sfrs"), address(0xBF8EA728)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT202bits_t;
extern volatile __GLCDCLUT202bits_t GLCDCLUT202bits __asm__ ("GLCDCLUT202") __attribute__((section("sfrs"), address(0xBF8EA728)));
#define GLCDCLUT203 GLCDCLUT203
extern volatile uint32_t   GLCDCLUT203 __attribute__((section("sfrs"), address(0xBF8EA72C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT203bits_t;
extern volatile __GLCDCLUT203bits_t GLCDCLUT203bits __asm__ ("GLCDCLUT203") __attribute__((section("sfrs"), address(0xBF8EA72C)));
#define GLCDCLUT204 GLCDCLUT204
extern volatile uint32_t   GLCDCLUT204 __attribute__((section("sfrs"), address(0xBF8EA730)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT204bits_t;
extern volatile __GLCDCLUT204bits_t GLCDCLUT204bits __asm__ ("GLCDCLUT204") __attribute__((section("sfrs"), address(0xBF8EA730)));
#define GLCDCLUT205 GLCDCLUT205
extern volatile uint32_t   GLCDCLUT205 __attribute__((section("sfrs"), address(0xBF8EA734)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT205bits_t;
