MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS169/mcu.h
#define _DDRCMD10_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD10_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD10_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD10_CSCMD1_POSITION                0x00000001
#define _DDRCMD10_CSCMD1_MASK                    0x000001FE
#define _DDRCMD10_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD10_RASCMD1_POSITION               0x00000009
#define _DDRCMD10_RASCMD1_MASK                   0x00000200
#define _DDRCMD10_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD10_CASCMD1_POSITION               0x0000000A
#define _DDRCMD10_CASCMD1_MASK                   0x00000400
#define _DDRCMD10_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD10_WENCMD1_POSITION               0x0000000B
#define _DDRCMD10_WENCMD1_MASK                   0x00000800
#define _DDRCMD10_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD10_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD10_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD10_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD10_CSCMD2_POSITION                0x0000000D
#define _DDRCMD10_CSCMD2_MASK                    0x001FE000
#define _DDRCMD10_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD10_RASCMD2_POSITION               0x00000015
#define _DDRCMD10_RASCMD2_MASK                   0x00200000
#define _DDRCMD10_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD10_CASCMD2_POSITION               0x00000016
#define _DDRCMD10_CASCMD2_MASK                   0x00400000
#define _DDRCMD10_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD10_WENCMD2_POSITION               0x00000017
#define _DDRCMD10_WENCMD2_MASK                   0x00800000
#define _DDRCMD10_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD10_MDALCMD_POSITION               0x00000018
#define _DDRCMD10_MDALCMD_MASK                   0xFF000000
#define _DDRCMD10_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD11_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD11_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD11_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD11_CSCMD1_POSITION                0x00000001
#define _DDRCMD11_CSCMD1_MASK                    0x000001FE
#define _DDRCMD11_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD11_RASCMD1_POSITION               0x00000009
#define _DDRCMD11_RASCMD1_MASK                   0x00000200
#define _DDRCMD11_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD11_CASCMD1_POSITION               0x0000000A
#define _DDRCMD11_CASCMD1_MASK                   0x00000400
#define _DDRCMD11_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD11_WENCMD1_POSITION               0x0000000B
#define _DDRCMD11_WENCMD1_MASK                   0x00000800
#define _DDRCMD11_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD11_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD11_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD11_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD11_CSCMD2_POSITION                0x0000000D
#define _DDRCMD11_CSCMD2_MASK                    0x001FE000
#define _DDRCMD11_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD11_RASCMD2_POSITION               0x00000015
#define _DDRCMD11_RASCMD2_MASK                   0x00200000
#define _DDRCMD11_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD11_CASCMD2_POSITION               0x00000016
#define _DDRCMD11_CASCMD2_MASK                   0x00400000
#define _DDRCMD11_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD11_WENCMD2_POSITION               0x00000017
#define _DDRCMD11_WENCMD2_MASK                   0x00800000
#define _DDRCMD11_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD11_MDALCMD_POSITION               0x00000018
#define _DDRCMD11_MDALCMD_MASK                   0xFF000000
#define _DDRCMD11_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD12_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD12_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD12_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD12_CSCMD1_POSITION                0x00000001
#define _DDRCMD12_CSCMD1_MASK                    0x000001FE
#define _DDRCMD12_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD12_RASCMD1_POSITION               0x00000009
#define _DDRCMD12_RASCMD1_MASK                   0x00000200
#define _DDRCMD12_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD12_CASCMD1_POSITION               0x0000000A
#define _DDRCMD12_CASCMD1_MASK                   0x00000400
#define _DDRCMD12_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD12_WENCMD1_POSITION               0x0000000B
#define _DDRCMD12_WENCMD1_MASK                   0x00000800
#define _DDRCMD12_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD12_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD12_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD12_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD12_CSCMD2_POSITION                0x0000000D
#define _DDRCMD12_CSCMD2_MASK                    0x001FE000
#define _DDRCMD12_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD12_RASCMD2_POSITION               0x00000015
#define _DDRCMD12_RASCMD2_MASK                   0x00200000
#define _DDRCMD12_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD12_CASCMD2_POSITION               0x00000016
#define _DDRCMD12_CASCMD2_MASK                   0x00400000
#define _DDRCMD12_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD12_WENCMD2_POSITION               0x00000017
#define _DDRCMD12_WENCMD2_MASK                   0x00800000
#define _DDRCMD12_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD12_MDALCMD_POSITION               0x00000018
#define _DDRCMD12_MDALCMD_MASK                   0xFF000000
#define _DDRCMD12_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD13_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD13_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD13_CLKENCMD1_LENGTH               0x00000001

