MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS169/mcu.h
#define _DDRCMD115_MDALCMD_POSITION              0x00000018
#define _DDRCMD115_MDALCMD_MASK                  0xFF000000
#define _DDRCMD115_MDALCMD_LENGTH                0x00000008

#define _DDRCMD20_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD20_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD20_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD20_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD20_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD20_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD20_WAIT_POSITION                  0x0000000B
#define _DDRCMD20_WAIT_MASK                      0x000FF800
#define _DDRCMD20_WAIT_LENGTH                    0x00000009

#define _DDRCMD21_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD21_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD21_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD21_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD21_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD21_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD21_WAIT_POSITION                  0x0000000B
#define _DDRCMD21_WAIT_MASK                      0x000FF800
#define _DDRCMD21_WAIT_LENGTH                    0x00000009

#define _DDRCMD22_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD22_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD22_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD22_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD22_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD22_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD22_WAIT_POSITION                  0x0000000B
#define _DDRCMD22_WAIT_MASK                      0x000FF800
#define _DDRCMD22_WAIT_LENGTH                    0x00000009

#define _DDRCMD23_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD23_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD23_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD23_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD23_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD23_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD23_WAIT_POSITION                  0x0000000B
#define _DDRCMD23_WAIT_MASK                      0x000FF800
#define _DDRCMD23_WAIT_LENGTH                    0x00000009

#define _DDRCMD24_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD24_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD24_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD24_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD24_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD24_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD24_WAIT_POSITION                  0x0000000B
#define _DDRCMD24_WAIT_MASK                      0x000FF800
#define _DDRCMD24_WAIT_LENGTH                    0x00000009

#define _DDRCMD25_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD25_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD25_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD25_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD25_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD25_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD25_WAIT_POSITION                  0x0000000B
#define _DDRCMD25_WAIT_MASK                      0x000FF800
#define _DDRCMD25_WAIT_LENGTH                    0x00000009

#define _DDRCMD26_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD26_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD26_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD26_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD26_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD26_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD26_WAIT_POSITION                  0x0000000B
#define _DDRCMD26_WAIT_MASK                      0x000FF800
#define _DDRCMD26_WAIT_LENGTH                    0x00000009

#define _DDRCMD27_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD27_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD27_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD27_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD27_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD27_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD27_WAIT_POSITION                  0x0000000B
#define _DDRCMD27_WAIT_MASK                      0x000FF800
#define _DDRCMD27_WAIT_LENGTH                    0x00000009

#define _DDRCMD28_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD28_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD28_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD28_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD28_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD28_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD28_WAIT_POSITION                  0x0000000B
#define _DDRCMD28_WAIT_MASK                      0x000FF800
#define _DDRCMD28_WAIT_LENGTH                    0x00000009

#define _DDRCMD29_MDADDRHCMD_POSITION            0x00000000
#define _DDRCMD29_MDADDRHCMD_MASK                0x000000FF
#define _DDRCMD29_MDADDRHCMD_LENGTH              0x00000008

#define _DDRCMD29_BNKADDRCMD_POSITION            0x00000008
#define _DDRCMD29_BNKADDRCMD_MASK                0x00000700
#define _DDRCMD29_BNKADDRCMD_LENGTH              0x00000003

#define _DDRCMD29_WAIT_POSITION                  0x0000000B
#define _DDRCMD29_WAIT_MASK                      0x000FF800
#define _DDRCMD29_WAIT_LENGTH                    0x00000009

#define _DDRCMD210_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD210_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD210_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD210_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD210_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD210_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD210_WAIT_POSITION                 0x0000000B
#define _DDRCMD210_WAIT_MASK                     0x000FF800
#define _DDRCMD210_WAIT_LENGTH                   0x00000009

#define _DDRCMD211_MDADDRHCMD_POSITION           0x00000000
#define _DDRCMD211_MDADDRHCMD_MASK               0x000000FF
#define _DDRCMD211_MDADDRHCMD_LENGTH             0x00000008

#define _DDRCMD211_BNKADDRCMD_POSITION           0x00000008
#define _DDRCMD211_BNKADDRCMD_MASK               0x00000700
#define _DDRCMD211_BNKADDRCMD_LENGTH             0x00000003

#define _DDRCMD211_WAIT_POSITION                 0x0000000B
#define _DDRCMD211_WAIT_MASK                     0x000FF800
#define _DDRCMD211_WAIT_LENGTH                   0x00000009

